# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [26]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [27]:
#Your code here
cur.execute('''select firstName, lastName from employees
                join offices
                on employees.officeCode = offices.officeCode
                where city = 'Boston';''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?

In [29]:
#Your code here
cur.execute('''select city, count(*)
                from employees
                left join offices
                using(officeCode)
                group by 1;''')
df = pd.DataFrame(cur.fetchall())
df
#no, all offices have employees

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6
5         Sydney  4
6          Tokyo  2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [40]:
# Your code here - how many orders for Volkswagen Microbuses were placed? 
cur.execute('''select count(quantityOrdered)
                from orderdetails
                join products
                using(productCode)
                where productname = '1962 Volkswagen Microbus';''')
cur.fetchall()

[(28,)]

In [38]:
# Your code here - what sales rep has the most customers?
cur.execute('''select firstname, lastname, count(customernumber)
                from employees e
                join customers c
                on e.employeeNumber = c.salesrepemployeenumber
                order by 2 desc
                limit 1;''')
cur.fetchall()

[('Martin', 'Gerard', 100)]

In [42]:
# Your code here - how many payments have Toys of Finland, Co. made?
cur.execute('''select count(checkNumber)
                from payments
                join customers
                using(customerNumber)
                where customername = 'Toys of Finland, Co.';''')
cur.fetchall()

[(3,)]

## Level Up: Display the names of each product each employee has sold.

In [49]:
# Your code here
cur.execute('''select firstname, lastname, productname
                from employees e
                join customers c
                on e.employeenumber = c.salesrepemployeenumber
                join orders o
                using(customernumber)
                join orderdetails od
                using(ordernumber)
                join products p
                using(productcode);''')
df = pd.DataFrame(cur.fetchall())
df.iloc[1000:1020]

           0       1                                      2
1000  George  Vanauf               1960 BSA Gold Star DBD34
1001  George  Vanauf               Corsair F4U ( Bird Cage)
1002  George  Vanauf                1900s Vintage Tri-Plane
1003  George  Vanauf                       1997 BMW F650 ST
1004  George  Vanauf               1928 Ford Phaeton Deluxe
1005  George  Vanauf           1930 Buick Marquette Phaeton
1006  George  Vanauf            American Airlines: B767-300
1007  George  Vanauf         America West Airlines B757-200
1008  George  Vanauf                          ATA: B757-300
1009  George  Vanauf                     F/A 18 Hornet 1/72
1010  George  Vanauf              American Airlines: MD-11S
1011  George  Vanauf       1912 Ford Model T Delivery Wagon
1012  George  Vanauf                  The Schooner Bluenose
1013  George  Vanauf              The USS Constitution Ship
1014  George  Vanauf  1969 Harley Davidson Ultimate Chopper
1015  George  Vanauf                  1996 Moto Guzzi 1100i
1016  George  Vanauf   2003 Harley-Davidson Eagle Drag Bike
1017  George  Vanauf                       2002 Suzuki XREO
1018  George  Vanauf    1936 Harley Davidson El Knucklehead
1019  George  Vanauf                      1997 BMW R 1100 S

## Level Up: Display the Number of Products each Employee Has sold

In [50]:
#Your code here
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!